In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [21]:
 df = pd.read_csv('../data/apply_demo.csv')

In [22]:
df.head(5)

         time                                data
0  1473411962   Symbol: APPL Seqno: 0 Price: 1623
1  1473411962   Symbol: APPL Seqno: 0 Price: 1623
2  1473411963   Symbol: APPL Seqno: 0 Price: 1623
3  1473411963   Symbol: APPL Seqno: 0 Price: 1623
4  1473411963   Symbol: APPL Seqno: 1 Price: 1649

In [23]:
df.size

7978

In [24]:
s1 = Series(['a']*7978)
df['A'] = s1

In [25]:
df.head(5)

         time                                data  A
0  1473411962   Symbol: APPL Seqno: 0 Price: 1623  a
1  1473411962   Symbol: APPL Seqno: 0 Price: 1623  a
2  1473411963   Symbol: APPL Seqno: 0 Price: 1623  a
3  1473411963   Symbol: APPL Seqno: 0 Price: 1623  a
4  1473411963   Symbol: APPL Seqno: 1 Price: 1649  a

In [77]:
df['A'] = df['A'].apply(str.upper)  # apply function str.upper to every single element in df['A']

In [27]:
df.head(5)

         time                                data  A
0  1473411962   Symbol: APPL Seqno: 0 Price: 1623  A
1  1473411962   Symbol: APPL Seqno: 0 Price: 1623  A
2  1473411963   Symbol: APPL Seqno: 0 Price: 1623  A
3  1473411963   Symbol: APPL Seqno: 0 Price: 1623  A
4  1473411963   Symbol: APPL Seqno: 1 Price: 1649  A

In [30]:
df['data'][0] # index 0  in y axis

' Symbol: APPL Seqno: 0 Price: 1623'

In [40]:
df['data'][0].split(' ')   # add ' ' to items to split

['', 'Symbol:', 'APPL', 'Seqno:', '0', 'Price:', '1623']

In [33]:
l1=df['data'][0].strip().split(' ')

In [34]:
l1

['Symbol:', 'APPL', 'Seqno:', '0', 'Price:', '1623']

In [35]:
l1[1],l1[3],l1[5]

('APPL', '0', '1623')

In [90]:
def foo(line):
    item = line.strip().split(' ')
    return Series([item[1],item[3],item[5]])

0    APPL
1       0
2    1623
dtype: object

In [86]:
df_tmp = df['data'].apply(foo)

In [92]:
df_tmp.head()

      0  1     2
0  APPL  0  1623
1  APPL  0  1623
2  APPL  0  1623
3  APPL  0  1623
4  APPL  1  1649

In [93]:
df_tmp=df_tmp.rename(columns = {0 : 'Symbol', 1: 'Seqno', 2:'Price'})

In [94]:
df_tmp.head()

  Symbol Seqno Price
0   APPL     0  1623
1   APPL     0  1623
2   APPL     0  1623
3   APPL     0  1623
4   APPL     1  1649

In [97]:
df_new = df.combine_first(df_tmp)
df_new.head()

   A   Price  Seqno Symbol                                data        time
0  A  1623.0    0.0   APPL   Symbol: APPL Seqno: 0 Price: 1623  1473411962
1  A  1623.0    0.0   APPL   Symbol: APPL Seqno: 0 Price: 1623  1473411962
2  A  1623.0    0.0   APPL   Symbol: APPL Seqno: 0 Price: 1623  1473411963
3  A  1623.0    0.0   APPL   Symbol: APPL Seqno: 0 Price: 1623  1473411963
4  A  1649.0    1.0   APPL   Symbol: APPL Seqno: 1 Price: 1649  1473411963

In [96]:
del df_new['data']
del df_new['A']

In [73]:
df_new.head()

    Price  Seqno Symbol        time
0  1623.0    0.0   APPL  1473411962
1  1623.0    0.0   APPL  1473411962
2  1623.0    0.0   APPL  1473411963
3  1623.0    0.0   APPL  1473411963
4  1649.0    1.0   APPL  1473411963

In [74]:
df_new.to_csv('../data/demo_duplicate.csv')

In [75]:
!ls '../data'

apply_demo.csv     demo_duplicate.csv imdb.csv           movie_metadata.csv

In [80]:
def foo():
    return 1,2,3

In [81]:
foo()

(1, 2, 3)